CSI API ETABS v1
cCombo.GetCaseList Method
 Retrieves all load cases and response combinations included in the load combination specified by the Name item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetCaseList(
	string Name,
	ref int NumberItems,
	ref eCNameType[] CNameType,
	ref string[] CName,
	ref double[] SF
)
Function GetCaseList (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef CNameType As eCNameType(),
	ByRef CName As String(),
	ByRef SF As Double()
) As Integer
Dim instance As cCombo
Dim Name As String
Dim NumberItems As Integer
Dim CNameType As eCNameType()
Dim CName As String()
Dim SF As Double()
Dim returnValue As Integer
returnValue = instance.GetCaseList(Name,
	NumberItems, CNameType, CName, SF)
int GetCaseList(
	String^ Name,
	int% NumberItems,
	array<eCNameType>^% CNameType,
	array<String^>^% CName,
	array<double>^% SF
)
abstract GetCaseList :
        Name : string *
        NumberItems : int byref *
        CNameType : eCNameType[] byref *
        CName : string[] byref *
        SF : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing load combination.
NumberItems
Type: System.Int32
 The total number of load cases and load combinations included in the load combination specified by the Name item.
CNameType
Type: ETABSv1.eCNameType[]
 This is one of the following items in the eCNameType enumeration:
LoadCase = 0
LoadCombo = 1
 This item indicates whether the CName item is an analysis case (LoadCase) or a load combination (LoadCombo).
CName
Type: System.String[]
 This is an array of the names of the load cases or load combinations included in the load combination specified by the Name item.
SF
Type: System.Double[]
 The scale factor multiplying the case or combination indicated by the CName item.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim NumberItems As Integer
       Dim CNameType() As eCNameType
       Dim CName() As String
       Dim SF() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add combo
       ret = SapModel.RespCombo.Add("COMB1", 0)
   'add load case to combo
       ret = SapModel.RespCombo.SetCaseList("COMB1", LoadCase, "DEAD", 1.4)
   'get all cases and combos included in combo COMB1
       ret = SapModel.RespCombo.GetCaseList("COMB1", NumberItems, CNameType, CName, SF)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cCombo Interface
ETABSv1 Namespace